app/controllers/flights_controller.rb

  def index
    @flights = Flight.where(nil)

    filter_params(params).each do |key, value|
      @flights = @flights.public_send(key, value) if value.present?
---
SELECT "flights".* FROM "flights"